# personal stuff

brew "ansible"
brew "asciinema"
brew "automake"
brew "awscli"
brew "azure-cli"
brew "bat"
brew "cmake"
brew "ctags"
brew "fd" # used as FZF_DEFAULT_COMMAND
brew "git"
brew "git-delta"
brew "go"
brew "graphviz"
brew "htop"
brew "jq"
brew "neovim"
brew "netcat"
brew "nmap"
brew "nvm"
brew "openvpn"
brew "pandoc"
brew "pstree"
brew "pv"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "tarsnap"
brew "terraform"
brew "thefuck"
brew "tmux"
brew "tree"
brew "yarn"
brew "z"

tap "homebrew/cask"
cask "docker"
cask "google-cloud-sdk"
cask "kdiff3"
cask "ngrok"
cask "obs"
cask "osxfuse"
cask "suspicious-package"
cask "vagrant"

# for work

brew "ffmpeg"
brew "gstreamer"
