# Docker
ms-azuretools.vscode-docker

# Formatting/linting
EditorConfig.EditorConfig

# Git
eamodio.gitlens
mhutchie.git-graph

# LiveShare
ms-vsliveshare.vsliveshare
ms-vsliveshare.vsliveshare-audio

# Remote
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl

# Themes
Equinusocio.vsc-community-material-theme
Equinusocio.vsc-material-theme
equinusocio.vsc-material-theme-icons

# Vim
vscodevim.vim

# .NET
k--kato.docomment
ms-dotnettools.csharp
formulahendry.dotnet-test-explorer

# Golang
golang.go

# HashiCorp
hashicorp.terraform
wholroyd.HCL

# JavaScript
esbenp.prettier-vscode
dbaeumer.vscode-eslint
gamunu.vscode-yarn
eg2.vscode-npm-script
octref.vetur
firefox-devtools.vscode-firefox-debug
msjsdiag.debugger-for-chrome
msjsdiag.debugger-for-edge

#PowerShell
ms-vscode.powershell-preview

# Python
ms-python.python

# Ruby
rebornix.ruby
wingrunr21.vscode-ruby

# Rust
rust-lang.rust

# SQL Server
ms-mssql.mssql
